of_test_case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  13
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}

internalField   uniform (10 0 0);

dimensions      [0 1 -1 0 0 0 0];

boundaryField
{
    xmin
    {
        type            freestreamVelocity;
        freestreamValue uniform (10 0 0);
        value           uniform (10 0 0);
    }
    xmax
    {
        type            freestreamVelocity;
        freestreamValue uniform (10 0 0);
        value           uniform (10 0 0);
    }
    ymin
    {
        type            freestreamVelocity;
        freestreamValue uniform (10 0 0);
        value           uniform (10 0 0);
    }
    ymax
    {
        type            freestreamVelocity;
        freestreamValue uniform (10 0 0);
        value           uniform (10 0 0);
    }
    zmin
    {
        type            freestreamVelocity;
        freestreamValue uniform (10 0 0);
        value           uniform (10 0 0);
    }
    zmax
    {
        type            freestreamVelocity;
        freestreamValue uniform (10 0 0);
        value           uniform (10 0 0);
    }
    body
    {
        type            noSlip;
    }
    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
