of_test_case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  13
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}

internalField   uniform 0;

dimensions      [0 2 -2 0 0 0 0];

boundaryField
{
    xmin
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    xmax
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    ymin
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    ymax
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    zmin
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    zmax
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    body
    {
        type            zeroGradient;
    }
    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
