of_test_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    xmin
    {
        type            patch;
        nFaces          1600;
        startFace       237960;
    }
    xmax
    {
        type            patch;
        nFaces          1600;
        startFace       239560;
    }
    ymin
    {
        type            patch;
        nFaces          1600;
        startFace       241160;
    }
    ymax
    {
        type            patch;
        nFaces          1600;
        startFace       242760;
    }
    zmin
    {
        type            patch;
        nFaces          1600;
        startFace       244360;
    }
    zmax
    {
        type            patch;
        nFaces          1600;
        startFace       245960;
    }
    body
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4020;
        startFace       247560;
    }
)

// ************************************************************************* //
