of_test_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  13
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

projArea        1;

vertices
(
    (-4.5 -4.5 -4.5)
    (4.5 -4.5 -4.5)
    (4.5 4.5 -4.5)
    (-4.5 4.5 -4.5)
    (-4.5 -4.5 4.5)
    (4.5 -4.5 4.5)
    (4.5 4.5 4.5)
    (-4.5 4.5 4.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    xmin
    {
        type patch;
        faces ((0 4 7 3));
    }
    xmax
    {
        type patch;
        faces ((1 2 6 5));
    }
    ymin
    {
        type patch;
        faces ((0 1 5 4));
    }
    ymax
    {
        type patch;
        faces ((3 7 6 2));
    }
    zmin
    {
        type patch;
        faces ((0 3 2 1));
    }
    zmax
    {
        type patch;
        faces ((4 5 6 7));
    }
);

mergePatchPairs
(
);
