of_test_case/system/forceCoeffsIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  13
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      forceCoeffsIncompressible;
}

patches         (body);

magUInf         10;
Aref            1;
dragDir         (1 0 0);
liftDir         (0 -1 0);

// Moment calculation parameters
lRef            1;
CofR            (0 0 0);
pitchAxis       (0 0 -1);

#includeEtc "caseDicts/functions/forces/forceCoeffsIncompressible.cfg"

rho             rhoInf;
rhoInf          1.225;

// ************************************************************************* //
